<a href="https://colab.research.google.com/github/vishalkumarlondon/data-viz-coursework-group-2/blob/master/colab-notebooks/google_places_api_coursework.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#### Necessary Library

In [0]:
!pip install pygsheets
!pip install --upgrade -q pygsheets
!pip install clean-text[gpl]

In [0]:
!pip install geopandas

In [0]:
!pip install python-sld

#### Authentification Google

In [0]:
# Authentification with google drive and colab
from google.colab import auth
auth.authenticate_user()

# Read google sheet
import gspread
from oauth2client.client import GoogleCredentials
gc = gspread.authorize(GoogleCredentials.get_application_default())

In [0]:
project_id = '' #add your Google Cloud Project ID
!gcloud config set project {project_id}

Updated property [core/project].


To take a quick anonymous survey, run:
  $ gcloud survey

### Data Preparation

In [0]:
# import the necessary library
import pandas as pd
import geopandas as gpd
from shapely import wkt
import numpy as np 
import os
import ast

from datetime import datetime
import re
import string
from pprint import pprint
from cleantext import clean

import seaborn as sns
import matplotlib.pyplot as plt

import pygsheets

import warnings
warnings.filterwarnings("ignore")

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

### Step0 - Get London, New York and Paris boundary data for boroughs and neighbourhoods

- Data source: http://download.geofabrik.de/europe/great-britain/england/greater-london.html

In [0]:
# London

!wget https://data.london.gov.uk/download/statistical-gis-boundary-files-london/9ba8c833-6370-4b11-abdc-314aa020d5e0/statistical-gis-boundaries-london.zip
!unzip statistical-gis-boundaries-london.zip

In [0]:
# New York

!wget https://www1.nyc.gov/assets/planning/download/zip/data-maps/open-data/nynta_20a.zip
!unzip nynta_20a.zip

#### open shapefile in geopandas dataframe

In [0]:
london_path = '/content/statistical-gis-boundaries-london/ESRI/London_Ward.shp'
london = gpd.read_file(london_path)

newyork_path = '/content/nynta_20a/nynta.shp'
newyork = gpd.read_file(newyork_path)

paris = gpd.read_file("https://opendata.paris.fr/explore/dataset/arrondissements/download/?format=shp&timezone=Europe/London&lang=fr")

london = london.to_crs('EPSG:4326')
newyork = newyork.to_crs('EPSG:4326')
paris = paris.to_crs('EPSG:4326')

In [0]:
london.head(2)

                     NAME  ...                                           geometry
0       Chessington South  ...  POLYGON ((-0.33068 51.32901, -0.33059 51.32909...
1  Tolworth and Hook Rise  ...  POLYGON ((-0.30846 51.37586, -0.30834 51.37606...

[2 rows x 8 columns]

In [0]:
newyork.head(2)

   BoroCode  ...                                           geometry
0         3  ...  POLYGON ((-73.97605 40.63128, -73.97717 40.630...
1         4  ...  POLYGON ((-73.80379 40.77561, -73.80099 40.775...

[2 rows x 8 columns]

In [0]:
paris.head(2)

       n_sq_ar  ...                                           geometry
0  750000001.0  ...  POLYGON ((2.32801 48.86992, 2.32997 48.86851, ...
1  750000002.0  ...  POLYGON ((2.35152 48.86443, 2.35095 48.86341, ...

[2 rows x 11 columns]

#### limit shapefile to inner areas

In [0]:
#limit London to Inner London Boroughs
INNER_LONDON = ['Camden', 
                'Greenwich', 
                'Hackney', 
                'Hammersmith and Fulham', 
                'Islington',
                'Kensington and Chelsea',
                'Lambeth',
                'Lewisham',
                'Southwark',
                'Tower Hamlets',
                'Wandsworth',
                'Westminster']

print(london.shape)

london = london[london['BOROUGH'].isin(INNER_LONDON)]

print(london.shape)

(649, 8)
(221, 8)

In [0]:
print(newyork.BoroName.value_counts())
print(newyork.NTAName.nunique())
print(newyork.shape)

#limit New York to Manhattan
# newyork = newyork[newyork.BoroName == 'Manhattan']
# print(newyork.shape)

Queens           58
Brooklyn         51
Bronx            38
Manhattan        29
Staten Island    19
Name: BoroName, dtype: int64
195
(195, 8)

#### expand Paris neighbourhoods

In [0]:
'''
Generate five random points inside of each of the 20 boroughs of Paris to make 100 points
similar to London and New York

# https://gis.stackexchange.com/questions/294394/randomly-sample-from-geopandas-dataframe-in-python

'''

from shapely.geometry import Point
import geopandas as gpd
import random

######
def random_points_in_polygon(number, polygon):
    points = []
    min_x, min_y, max_x, max_y = polygon.bounds
    i= 0
    while i < number:
        point = Point(random.uniform(min_x, max_x), random.uniform(min_y, max_y))
        if polygon.contains(point):
            points.append(point)
            i += 1
    return points  # returns list of shapely point
######

def Get_RandomPoints_df(dataframe):

  allindex_list = []
  alllatitude_list = []
  alllongitude_list = []

  for row in range(len(paris)):  
      # get inside the api reponse
      points = random_points_in_polygon(5, paris.geometry[row])

      #properties
      index_list = []
      latitude_list = []
      longitude_list = []

      for j, point in enumerate(points):
        # get the index from the dataframe - merge, join for later
         data_index = row
         index_list.append(data_index)

         try:
           latitude = np.around(point.x, decimals=3)
           latitude_list.append(latitude)

           longitude = np.around(point.y, decimals=3)
           longitude_list.append(longitude)

         except:
           latitude = 'NaN'
           latitude_list.append(latitude)

           longitude = 'NaN'
           longitude_list.append(longitude)

      #append all result to final list
      allindex_list.append(index_list)
      alllatitude_list.append(latitude_list)
      alllongitude_list.append(longitude_list)

  dict_df = {'data_index':allindex_list,
             'lat':alllatitude_list,
             'long':alllongitude_list
             }

  apirep_df = pd.DataFrame(dict_df)
  return apirep_df

In [0]:
paris_points = Get_RandomPoints_df(paris)

In [0]:
print(paris.shape, paris_points.shape)

(20, 11) (20, 3)

In [0]:
#make a new dataframe
paris_expanded = pd.concat([paris, paris_points], axis=1)

In [0]:
#drop all duplicate rows by the neighbourhood column in the Ward dataframe
paris_expanded = paris_expanded.drop_duplicates(subset='l_ar')

In [0]:
#limit the new dataframe by the neighbourhood index, lat and long coordinates
paris_expanded = paris_expanded.loc[:, ['l_ar', 'lat', 'long']]

In [0]:
paris_expanded

          l_ar  ...                                      long
0     1er Ardt  ...  [48.861, 48.862, 48.858, 48.859, 48.864]
1    2ème Ardt  ...    [48.867, 48.87, 48.87, 48.871, 48.864]
2   17ème Ardt  ...   [48.896, 48.891, 48.878, 48.89, 48.892]
3   14ème Ardt  ...   [48.82, 48.833, 48.839, 48.822, 48.835]
4   20ème Ardt  ...   [48.87, 48.865, 48.854, 48.855, 48.871]
5    7ème Ardt  ...     [48.856, 48.857, 48.86, 48.86, 48.86]
6   11ème Ardt  ...    [48.85, 48.864, 48.859, 48.854, 48.86]
7   13ème Ardt  ...    [48.823, 48.82, 48.817, 48.83, 48.818]
8    4ème Ardt  ...  [48.854, 48.854, 48.858, 48.858, 48.857]
9    8ème Ardt  ...    [48.87, 48.87, 48.871, 48.873, 48.878]
10  18ème Ardt  ...  [48.895, 48.887, 48.898, 48.899, 48.895]
11   9ème Ardt  ...  [48.881, 48.876, 48.872, 48.881, 48.883]
12  19ème Ardt  ...  [48.884, 48.897, 48.885, 48.885, 48.873]
13  15ème Ardt  ...  [48.843, 48.839, 48.846, 48.835, 48.843]
14   3ème Ardt  ...   [48.861, 48.861, 48.868, 48.86, 48.864]
15   5ème Ardt  ...  [48.847, 48.844, 48.852, 48.846, 48.848]
16   6ème Ardt  ...  [48.852, 48.851, 48.855, 48.846, 48.851]
17  12ème Ardt  ...  [48.824, 48.825, 48.836, 48.832, 48.831]
18  10ème Ardt  ...    [48.88, 48.88, 48.873, 48.874, 48.872]
19  16ème Ardt  ...  [48.853, 48.853, 48.858, 48.843, 48.857]

[20 rows x 3 columns]

In [0]:
# Explode the multiple list-like columns for each neighbourhood
# https://stackoverflow.com/questions/45846765/efficient-way-to-unnest-explode-multiple-list-columns-in-a-pandas-dataframe

p = (paris_expanded.set_index('l_ar')
   .apply(lambda x: x.apply(pd.Series).stack())
   .reset_index()
   .drop('level_1', 1))

In [0]:
p.shape

(100, 3)

In [0]:
paris = paris.merge(p, on='l_ar', how='inner')

In [0]:
print(paris.shape)
paris.head(1)

(100, 13)

       n_sq_ar  c_ar  ...    lat    long
0  750000001.0   1.0  ...  2.339  48.861

[1 rows x 13 columns]

#### join & create cendriods LDN, NYC, PAR

In [0]:
'''
start with London and New York because we already have 
five random points inside the centre of Paris Boroughs

'''

london = london.loc[:, ['BOROUGH', 'NAME', 'geometry']]
newyork = newyork.loc[:, ['BoroName', 'NTAName', 'geometry']]

london.columns = ['Borough',	'Neighborhood', 'geometry']
newyork.columns = ['Borough',	'Neighborhood', 'geometry']

london['city'] = 'London'
newyork['city'] = 'New York'

gdf_cities = pd.concat([london, newyork])

In [0]:
gdf_cities.head()

     Borough  ...    city
208  Lambeth  ...  London
209  Lambeth  ...  London
210  Lambeth  ...  London
211  Lambeth  ...  London
212  Lambeth  ...  London

[5 rows x 4 columns]

In [0]:
def getXY(pt):
    return (pt.x, pt.y)
centroidseries = gdf_cities['geometry'].centroid
x, y = [list(t) for t in zip(*map(getXY, centroidseries))]

In [0]:
gdf_cities['Longitude'] = x
gdf_cities['Latitude'] = y

In [0]:
gdf_cities.head()

     Borough     Neighborhood  ... Longitude   Latitude
208  Lambeth  Streatham South  ... -0.130382  51.417380
209  Lambeth    St. Leonard's  ... -0.133502  51.429830
210  Lambeth  Streatham Wells  ... -0.121877  51.429980
211  Lambeth    Knight's Hill  ... -0.107899  51.429287
212  Lambeth         Thornton  ... -0.136736  51.447030

[5 rows x 6 columns]

In [0]:
#Join Paris data with London and New York

paris = paris.loc[:, ['l_ar', 'l_aroff', 'geometry', 'lat', 'long']]
paris.columns = ['Borough',	'Neighborhood', 'geometry', 'Longitude', 'Latitude']
paris['city'] = 'Paris'

gdf_cities = pd.concat([paris, gdf_cities])

In [0]:
print(gdf_cities.shape)
gdf_cities.head()

(516, 6)

    Borough Neighborhood  ... Latitude   city
0  1er Ardt       Louvre  ...   48.861  Paris
1  1er Ardt       Louvre  ...   48.862  Paris
2  1er Ardt       Louvre  ...   48.858  Paris
3  1er Ardt       Louvre  ...   48.859  Paris
4  1er Ardt       Louvre  ...   48.864  Paris

[5 rows x 6 columns]

In [0]:
gdf_cities.city.value_counts()

London      221
New York    195
Paris       100
Name: city, dtype: int64

#### save neighbourhood centroid coordinates

In [0]:
gdf_cities.to_csv('fashion_week_cities_location_search_Q2_2020.csv')
# !gsutil cp "fashion_week_cities_location_search_Q2_2020.csv" gs://public-data-data_viz-2

Copying file://fashion_week_cities_location_search_Q2_2020.csv [Content-Type=text/csv]...
/ [1 files][  6.1 MiB/  6.1 MiB]
Operation completed over 1 objects/6.1 MiB.

### Step 1 - Get Location Data GoogleAPI

#### GoogleAPI Key - Get Google Adresse

In [0]:
gdf_osm.head(3)

In [0]:
import urllib
import requests
import json
import time
from tqdm import tqdm

# Google Maps API Key
API_key = '' # your API Key here

## Request with JSON output! 
## https://developers.google.com/places/web-service/search

def Get_PlaceRating(row):

    for i in tqdm(range(10)):
      time.sleep(6)
  
    try:
        url = 'https://maps.googleapis.com/maps/api/place/nearbysearch/json?location='+str(row['Latitude'])+','+str(row['Longitude'])+'&radius=500&type=art_gallery,clothing_store,tourist_attraction,night_club,museum&key='+str(API_key)         
        response = (requests.get(url).text)
        response_json = json.loads(response)
        return response_json  
    except Exception as error:
        raise error

#### API Response in Google Bucket

In [0]:
# run the google API
gdf_cities['API_response'] = gdf_cities.apply(Get_PlaceRating, axis=1)

# save the data into google bucket!
gdf_cities.to_csv('new.csv')
!gsutil cp  'new.csv' gs://public-data-data_viz-2/

### Step 2 - Clean OSM API Response

#### Read data

In [0]:
#pull data from GCP bucket
!gsutil cp gs://public-data-data_viz-2/fw19_placesapi_reponse.csv fw19_placesapi_reponse.csv

Copying gs://public-data-data_viz-2/fw19_placesapi_reponse.csv...
/ [1 files][ 16.0 MiB/ 16.0 MiB]
Operation completed over 1 objects/16.0 MiB.

In [0]:
data = pd.read_csv('fw19_placesapi_reponse.csv')
data = data.drop(columns='Unnamed: 0')

In [0]:
data.head(2)

    Borough  ...                                       API_response
0  1er Ardt  ...  {'html_attributions': [], 'next_page_token': '...
1  1er Ardt  ...  {'html_attributions': [], 'next_page_token': '...

[2 rows x 7 columns]

#### Get the Ratings (Parse Json API_response)

###### step1 - get non-empty api_response

In [0]:
def Get_EmptyReponse(dataframe):
  
  api_replist = []

  for row in range(len(dataframe)): 
          # get inside the api reponse
          api_rep = ast.literal_eval(dataframe['API_response'][row])
          # check if list is empty? if yes - nan, if no - api_rep
          if len(api_rep['place_id']) == 0:
            api_rep = 'NaN'
          else:
            api_rep = api_rep['place_id']

          api_replist.append(api_rep)

  dataframe['api_rep'] = api_replist
  return dataframe

In [0]:
# data = Get_EmptyReponse(data)
# data.head(1)

# data_notempty = data[data['api_rep'] != 'NaN']
# print('Length of data: '+str(len(data)))
# print('Length of data with an API reponse: '+str(len(data_notempty)))

###### step2 - access api_response data

In [0]:
import pprint

def Get_APIresponse_df(dataframe):

  allindex_list = []
  allname_list = []
  alladdress_list = []
  alllatitude_list = []
  alllongitude_list = []
  allrating_list = []
  alluser_ratings_list = []
  alltypes_list = []

  apirep_list = []
  apiisrep_list = []

  for row in range(len(dataframe)):  
      # get inside the api reponse
      api_rep = ast.literal_eval(dataframe['API_response'][row])
      results = api_rep['results']
      if len(results) == 0:
        results_new = 'False'
      else:
        results_new = 'True'

      #properties
      index_list = []
      name_list = []
      address_list = []
      latitude_list = []
      longitude_list = []
      rating_list = []
      user_ratings_list = []
      types_list = []

      for i in range(len(results)):
        # get the index from the dataframe - merge, join for later
         data_index = row
         index_list.append(data_index)
         try:
           name = results[i]['name']
           name_list.append(name)

           address = results[i]['vicinity']
           address_list.append(address)

           latitude = results[i]['geometry']['location']['lat']
           latitude_list.append(latitude)

           longitude = results[i]['geometry']['location']['lng']
           longitude_list.append(longitude)

           rating = results[i]['rating']
           rating_list.append(rating)

           user_ratings = results[i]['user_ratings_total']
           user_ratings_list.append(user_ratings)

           types = results[i]['types']
           types_list.append(types)

         except:
           name = 'NaN'
           name_list.append(name)

           address = 'NaN'
           address_list.append(address)

           latitude = 'NaN'
           latitude_list.append(latitude)

           longitude = 'NaN'
           longitude_list.append(longitude)

           rating = 'NaN'
           rating_list.append(rating)

           user_ratings = 'NaN'
           user_ratings_list.append(user_ratings)

      #append all result to final list
      allindex_list.append(index_list)
      allname_list.append(name_list)
      alladdress_list.append(address_list)
      alllatitude_list.append(latitude_list)
      alllongitude_list.append(longitude_list)
      allrating_list.append(rating_list)
      alluser_ratings_list.append(user_ratings_list)
      alltypes_list.append(types_list)
      
      apiisrep_list.append(results_new)
      apirep_list.append(results)

  dict_df = {'data_index':allindex_list,
             'name':allname_list,
             'address':alladdress_list,
             'lat':alllatitude_list,
             'long':alllongitude_list,
             'rating':allrating_list,
             'user_ratings_total': alluser_ratings_list,
             'types': alltypes_list,

             'is_apirep':apiisrep_list,
             'api_rep':apirep_list}

  apirep_df = pd.DataFrame(dict_df)
  return apirep_df

In [0]:
apirep_df = Get_APIresponse_df(data)

In [0]:
apirep_df.head(2)

                                          data_index  ...                                            api_rep
0  [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, ...  ...  [{'geometry': {'location': {'lat': 48.85661400...
1  [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, ...  ...  [{'geometry': {'location': {'lat': 48.85661400...

[2 rows x 10 columns]

In [0]:
apirep_df = apirep_df.iloc[:,:8]

In [0]:
print(data.shape, apirep_df.shape)

(516, 7) (516, 8)

###### step3 - join api_response data on index

In [0]:
#make a new dataframe by concatinating the Ward dataframe and the API repsonse dataframe on the same index
new_data = pd.concat([data, apirep_df], axis=1)

In [0]:
new_data.head(2)

  Neighborhood  ...                                               long
0       Louvre  ...  [2.3522219, NaN, 2.344054, 2.341004799999999, ...
1       Bourse  ...  [2.3522219, NaN, 2.349895800000001, 2.3486459,...

[2 rows x 8 columns]

In [0]:
#drop all duplicate rows by the NAME column in the Ward dataframe
new_data = new_data.drop_duplicates(subset='Neighborhood')

In [0]:
new_data.head(2)

     Borough  ...                                              types
0   1er Ardt  ...  [[lodging, point_of_interest, establishment], ...
5  2ème Ardt  ...  [[lodging, point_of_interest, establishment], ...

[2 rows x 15 columns]

In [0]:
new_data.drop('API_response', axis=1, inplace=True)
new_data.reset_index(inplace=True)

In [0]:
new_data.columns

Index(['index', 'Borough', 'Neighborhood', 'geometry', 'Longitude', 'Latitude',
       'city', 'data_index', 'name', 'address', 'lat', 'long', 'rating',
       'user_ratings_total', 'types'],
      dtype='object')

In [0]:
new_data = new_data.loc[:, ['Neighborhood', 'name',
                            'address', 'rating', 
                            'user_ratings_total', 'types', 
                            'lat', 'long',]]

In [0]:
# new_data.reset_index(inplace=True)

In [0]:
new_data.head()

          Neighborhood  ...                                               long
0               Louvre  ...  [2.3522219, NaN, 2.344054, 2.341004799999999, ...
1               Bourse  ...  [2.3522219, NaN, 2.349895800000001, 2.3486459,...
2  Batignolles-Monceau  ...  [2.3522219, NaN, 2.3167206, 2.321625, 2.317733...
3         Observatoire  ...  [2.3522219, NaN, 2.3345877, 2.3263139, 2.33069...
4         Ménilmontant  ...  [2.3522219, NaN, 2.4114796, 2.4079531, 2.41511...

[5 rows x 8 columns]

In [0]:
new_data[new_data.index.duplicated()]

Empty DataFrame
Columns: [Neighborhood, name, address, rating, user_ratings_total, types, lat, long]
Index: []

###### step4 - explode list-like columns by Neighbourhood

In [0]:
# How to explode multiple list-like columns
# https://stackoverflow.com/questions/45846765/efficient-way-to-unnest-explode-multiple-list-columns-in-a-pandas-dataframe

x = (new_data.set_index('Neighborhood')
   .apply(lambda x: x.apply(pd.Series).stack())
   .reset_index()
   .drop('level_1', 1))

In [0]:
x.sample(20)

                                            Neighborhood  ...       long
7004                                           Northcote  ...  -0.165187
5887                                             Livesey  ...        NaN
8188                                           Rego Park  ...   -73.8621
1018                                            Bow West  ... -0.0361959
6155   Mariner's Harbor-Arlington-Port Ivory-Granitev...  ...   -74.1698
333                                         Baisley Park  ...   -73.7874
1677                                          Cantelowes  ...  -0.126479
8191                                           Rego Park  ...   -73.8629
419                                  Batignolles-Monceau  ...    2.31526
4267                                           Gravesend  ...   -73.9816
8159                                       Regent's Park  ...  -0.156969
7403                                    Palace Riverside  ...  -0.215063
9666                                    Sunset Park East  ...        NaN
5199                          Jamaica Estates-Holliswood  ...        NaN
1439                                     Buttes-Chaumont  ...     2.3871
11069                                    Windsor Terrace  ...   -73.9782
522                                            Bayswater  ...  -0.193236
7671                                           Peninsula  ...  0.0137755
10552                                      West Brighton  ...   -73.9683
9801                                           Tachbrook  ...        NaN

[20 rows x 8 columns]

In [0]:
x.shape

(11411, 8)

###### step5 - clean data and push to GCP

In [0]:
x.lat.isna().sum()

159

In [0]:
#remove data when latitude is NaN
x = x[x.lat !='NaN']

In [0]:
x.sample(20)

                                    Neighborhood  ...       long
10363                                    Village  ...  -0.085066
4966                                   Homecrest  ...    -73.965
1126                                    Brockley  ... -0.0291841
10722  West New Brighton-New Brighton-St. George  ...    -74.106
213                                        Askew  ...  -0.243725
10084                                       Town  ...  -0.204246
10069                                       Town  ...  -0.127758
9505                              Streatham Hill  ...  -0.127758
1680                                  Cantelowes  ...  -0.139097
6191                                     Maspeth  ...   -73.8993
11053                               Williamsburg  ...   -73.9442
3880                             Fulham Broadway  ...   -0.20145
5233                    Kensington-Ocean Parkway  ...   -73.9761
1891                                    Charlton  ...  0.0370204
6172                      Marylebone High Street  ...   -0.15586
7736                                   Plumstead  ...  0.0984713
9054                  Spuyten Duyvil-Kingsbridge  ...   -73.9096
10393                             Vincent Square  ...  -0.130781
8255                               Richmond Hill  ...   -73.8281
3397                                     Erasmus  ...   -73.9536

[20 rows x 8 columns]

In [0]:
data.head()

    Borough  ...                                       API_response
0  1er Ardt  ...  {'html_attributions': [], 'next_page_token': '...
1  1er Ardt  ...  {'html_attributions': [], 'next_page_token': '...
2  1er Ardt  ...  {'html_attributions': [], 'next_page_token': '...
3  1er Ardt  ...  {'html_attributions': [], 'next_page_token': '...
4  1er Ardt  ...  {'html_attributions': [], 'next_page_token': '...

[5 rows x 7 columns]

In [0]:
city_data = data.loc[:, ['Neighborhood', 'city']].merge(x, on='Neighborhood', how='inner')

In [0]:
print(city_data.shape, x.shape)

(10092, 9) (8454, 8)

In [0]:
city_data.head()

  Neighborhood   city  ...      lat     long
0       Louvre  Paris  ...  48.8566  2.35222
1       Louvre  Paris  ...  48.8603  2.34405
2       Louvre  Paris  ...  48.8592    2.341
3       Louvre  Paris  ...  48.8607  2.34258
4       Louvre  Paris  ...  48.8592   2.3409

[5 rows x 9 columns]

In [0]:
city_data.drop_duplicates(subset=['Neighborhood', 'city', 'name'], inplace=True)

print(city_data.shape)

(8456, 9)

In [0]:
# save the data into google bucket!
city_data.to_csv('new.csv')
!gsutil cp  'new.csv' gs://public-data-data_viz-2/

Copying file://fw19_placesapi_reponse_clean.csv [Content-Type=text/csv]...
/ [1 files][  1.2 MiB/  1.2 MiB]
Operation completed over 1 objects/1.2 MiB.